[Killed] BlockStatement
src/CommandRegistry.ts:22:42
    * @throws Error if a command with the same name is already registered
    */
   register(command: Command): this {
-    if (this.commands.has(command.name)) {
-      throw new Error(`Command '${command.name}' is already registered`)
-    }
+    if (this.commands.has(command.name)) {}
     this.commands.set(command.name, command)
     return this
killedBy: CommandRegistry register should throw error when registering duplicate command name
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/CommandRegistry.ts:22:9
    * @throws Error if a command with the same name is already registered
    */
   register(command: Command): this {
-    if (this.commands.has(command.name)) {
+    if (false) {
       throw new Error(`Command '${command.name}' is already registered`)
     }
killedBy: CommandRegistry register should throw error when registering duplicate command name
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/CommandRegistry.ts:82:17
   /**
    * Remove all registered commands.
    */
-  clear(): void {
-    this.commands.clear()
-  }
+  clear(): void {}
 
   /**
killedBy: CommandRegistry clear should remove all commands
statusReason: expected 3 to be +0 // Object.is equality
