[Killed] LogicalOperator
src/commands/cd.ts:19:24
 
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Default to root if no path provided
-    const targetPath = args[0] ?? '/'
+    const targetPath = args[0] && '/'
 
     // Resolve the path relative to current directory
killedBy: cd command execute with valid path should change to absolute path
statusReason: expected "vi.fn()" to be called with arguments: [ '/var/log' ]

Received: 

  1st vi.fn() call:

  [
-   "/var/log",

[Killed] BooleanLiteral
src/commands/cd.ts:26:9
     const resolvedPath = resolvePath(currentDir, targetPath)
 
     // Check if path exists
-    if (!fs.exists(resolvedPath)) {
+    if (fs.exists(resolvedPath)) {
       return {
         exitCode: 1,
killedBy: cd command execute with valid path should change to absolute path
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cd.ts:26:9
     const resolvedPath = resolvePath(currentDir, targetPath)
 
     // Check if path exists
-    if (!fs.exists(resolvedPath)) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cd command execute with invalid path should return error when path does not exist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/commands/cd.ts:29:17
     if (!fs.exists(resolvedPath)) {
       return {
         exitCode: 1,
-        stdout: '',
+        stdout: "Stryker was here!",
         stderr: `cd: ${resolvedPath}: no such file or directory`,
       }
killedBy: cd command execute with invalid path should return error when path does not exist
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/commands/cd.ts:30:17
       return {
         exitCode: 1,
         stdout: '',
-        stderr: `cd: ${resolvedPath}: no such file or directory`,
+        stderr: ``,
       }
     }
killedBy: cd command execute with invalid path should return error when path does not exist
statusReason: expected '' to contain 'no such file or directory'

[Killed] ConditionalExpression
src/commands/cd.ts:35:9
     }
 
     // Check if path is a directory
-    if (!fs.isDirectory(resolvedPath)) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cd command execute with invalid path should return error when path is a file, not directory
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/commands/cd.ts:35:40
     }
 
     // Check if path is a directory
-    if (!fs.isDirectory(resolvedPath)) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `cd: ${resolvedPath}: not a directory`,
-      }
-    }
+    if (!fs.isDirectory(resolvedPath)) {}
 
     // Change directory
killedBy: cd command execute with invalid path should return error when path is a file, not directory
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/commands/cd.ts:48:15
 
     return {
       exitCode: 0,
-      stdout: '',
+      stdout: "Stryker was here!",
       stderr: '',
     }
killedBy: cd command execute with valid path should change to absolute path
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/commands/cd.ts:49:15
     return {
       exitCode: 0,
       stdout: '',
-      stderr: '',
+      stderr: "Stryker was here!",
     }
   },
killedBy: cd command execute with valid path should change to absolute path
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
