[Killed] StringLiteral
src/commands/clear.ts:22:15
     // \x1b[H  - Move cursor to home position (1,1)
     return {
       exitCode: 0,
-      stdout: '\x1b[2J\x1b[H',
+      stdout: "",
       stderr: '',
     }
killedBy: clear command execute should return ANSI escape sequence to clear screen in stdout
statusReason: expected '' to be '\u001b[2J\u001b[H' // Object.is equality
