[Killed] BlockStatement
src/commands/cp.ts:11:82
 /**
  * Recursively copy a directory and its contents.
  */
-function copyDirectory(srcPath: string, destPath: string, fs: IFileSystem): void {
-  // Create the destination directory
-  fs.createDirectory(destPath)
-
-  // List and copy contents
-  const entries = fs.listDirectory(srcPath)
-  for (const entry of entries) {
-    const srcEntryPath = joinPath(srcPath, entry.name)
-    const destEntryPath = joinPath(destPath, entry.name)
-
-    if (entry.type === 'directory') {
-      copyDirectory(srcEntryPath, destEntryPath, fs)
-    } else {
-      const content = fs.readFile(srcEntryPath)
-      fs.writeFile(destEntryPath, content)
-    }
-  }
-}
+function copyDirectory(srcPath: string, destPath: string, fs: IFileSystem): void {}
 
 /**
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/cp.ts:17:32
 
   // List and copy contents
   const entries = fs.listDirectory(srcPath)
-  for (const entry of entries) {
-    const srcEntryPath = joinPath(srcPath, entry.name)
-    const destEntryPath = joinPath(destPath, entry.name)
-
-    if (entry.type === 'directory') {
-      copyDirectory(srcEntryPath, destEntryPath, fs)
-    } else {
-      const content = fs.readFile(srcEntryPath)
-      fs.writeFile(destEntryPath, content)
-    }
-  }
+  for (const entry of entries) {}
 }
 
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/subdir' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/subdir",

[Killed] BlockStatement
src/commands/cp.ts:21:37
     const srcEntryPath = joinPath(srcPath, entry.name)
     const destEntryPath = joinPath(destPath, entry.name)
 
-    if (entry.type === 'directory') {
-      copyDirectory(srcEntryPath, destEntryPath, fs)
-    } else {
+    if (entry.type === 'directory') {} else {
       const content = fs.readFile(srcEntryPath)
       fs.writeFile(destEntryPath, content)
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/subdir' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/subdir",

[Killed] ConditionalExpression
src/commands/cp.ts:21:9
     const srcEntryPath = joinPath(srcPath, entry.name)
     const destEntryPath = joinPath(destPath, entry.name)
 
-    if (entry.type === 'directory') {
+    if (false) {
       copyDirectory(srcEntryPath, destEntryPath, fs)
     } else {
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/subdir' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/subdir",

[Killed] BlockStatement
src/commands/cp.ts:23:12
 
     if (entry.type === 'directory') {
       copyDirectory(srcEntryPath, destEntryPath, fs)
-    } else {
-      const content = fs.readFile(srcEntryPath)
-      fs.writeFile(destEntryPath, content)
-    }
+    } else {}
   }
 }
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/commands/cp.ts:42:7
   recursive: boolean
 ): CommandResult | null {
   // Check if source is a directory
-  if (fs.isDirectory(resolvedSource)) {
+  if (false) {
     if (!recursive) {
       return {
killedBy: cp command execute copying directory without -r flag should return error when copying directory without -r flag
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:42:7
   recursive: boolean
 ): CommandResult | null {
   // Check if source is a directory
-  if (fs.isDirectory(resolvedSource)) {
+  if (true) {
     if (!recursive) {
       return {
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:43:9
 ): CommandResult | null {
   // Check if source is a directory
   if (fs.isDirectory(resolvedSource)) {
-    if (!recursive) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cp command execute copying directory without -r flag should return error when copying directory without -r flag
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:43:9
 ): CommandResult | null {
   // Check if source is a directory
   if (fs.isDirectory(resolvedSource)) {
-    if (!recursive) {
+    if (true) {
       return {
         exitCode: 1,
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:59:7
 
   // Check if destination is a directory
   let finalDest = resolvedDest
-  if (fs.exists(resolvedDest) && fs.isDirectory(resolvedDest)) {
+  if (true) {
     // Copy into directory with same name
     const basename = getBasename(sourcePath)
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/dest.txt', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/dest.txt",

[Killed] ConditionalExpression
src/commands/cp.ts:59:7
 
   // Check if destination is a directory
   let finalDest = resolvedDest
-  if (fs.exists(resolvedDest) && fs.isDirectory(resolvedDest)) {
+  if (false) {
     // Copy into directory with same name
     const basename = getBasename(sourcePath)
killedBy: cp command execute copying file to directory should copy file into destination directory with same name
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/source.txt",

[Killed] StringLiteral
src/commands/cp.ts:75:9
  * Requires -r flag for copying directories (like bash).
  */
 export const cp: Command = {
-  name: 'cp',
+  name: "",
   description: 'Copy files and directories',
   usage: 'cp [-r] <source>... <destination>',
killedBy: cp command metadata should have correct name
statusReason: expected '' to be 'cp' // Object.is equality

[Killed] StringLiteral
src/commands/cp.ts:77:10
 export const cp: Command = {
   name: 'cp',
   description: 'Copy files and directories',
-  usage: 'cp [-r] <source>... <destination>',
+  usage: "",
 
   execute(args: string[], fs: IFileSystem): CommandResult {
killedBy: cp command metadata should have usage information
statusReason: expected '' to be truthy

[Killed] EqualityOperator
src/commands/cp.ts:82:40
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Parse -r flag
     const recursive = args.includes('-r')
-    const paths = args.filter((arg) => arg !== '-r')
+    const paths = args.filter((arg) => arg === '-r')
 
     // Check for required arguments
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] MethodExpression
src/commands/cp.ts:82:19
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Parse -r flag
     const recursive = args.includes('-r')
-    const paths = args.filter((arg) => arg !== '-r')
+    const paths = args
 
     // Check for required arguments
killedBy: cp command execute copying directory with -r flag should copy directory and its contents with -r flag
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:85:9
     const paths = args.filter((arg) => arg !== '-r')
 
     // Check for required arguments
-    if (paths.length === 0) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cp command execute with missing arguments should return error when no arguments provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BlockStatement
src/commands/cp.ts:85:29
     const paths = args.filter((arg) => arg !== '-r')
 
     // Check for required arguments
-    if (paths.length === 0) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: 'cp: missing file operand',
-      }
-    }
+    if (paths.length === 0) {}
 
     if (paths.length === 1) {
killedBy: cp command execute with missing arguments should return error when no arguments provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
src/commands/cp.ts:93:9
       }
     }
 
-    if (paths.length === 1) {
+    if (paths.length !== 1) {
       return {
         exitCode: 1,
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:93:9
       }
     }
 
-    if (paths.length === 1) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cp command execute with missing arguments should return error when only source provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
src/commands/cp.ts:97:17
       return {
         exitCode: 1,
         stdout: '',
-        stderr: `cp: missing destination file operand after '${paths[0]}'`,
+        stderr: ``,
       }
     }
killedBy: cp command execute with missing arguments should return error when only source provided
statusReason: expected '' to contain 'missing destination'

[Killed] EqualityOperator
src/commands/cp.ts:104:9
     const currentDir = fs.getCurrentDirectory()
 
     // Handle multiple sources (Unix-style: cp source1 source2 ... destdir)
-    if (paths.length > 2) {
+    if (paths.length <= 2) {
       const sources = paths.slice(0, -1)
       const destPath = paths[paths.length - 1]
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/commands/cp.ts:104:9
     const currentDir = fs.getCurrentDirectory()
 
     // Handle multiple sources (Unix-style: cp source1 source2 ... destdir)
-    if (paths.length > 2) {
+    if (paths.length >= 2) {
       const sources = paths.slice(0, -1)
       const destPath = paths[paths.length - 1]
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UnaryOperator
src/commands/cp.ts:105:38
 
     // Handle multiple sources (Unix-style: cp source1 source2 ... destdir)
     if (paths.length > 2) {
-      const sources = paths.slice(0, -1)
+      const sources = paths.slice(0, +1)
       const destPath = paths[paths.length - 1]
       const resolvedDest = resolvePath(currentDir, destPath)
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/dir2' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/dir2",

[Killed] MethodExpression
src/commands/cp.ts:105:23
 
     // Handle multiple sources (Unix-style: cp source1 source2 ... destdir)
     if (paths.length > 2) {
-      const sources = paths.slice(0, -1)
+      const sources = paths
       const destPath = paths[paths.length - 1]
       const resolvedDest = resolvePath(currentDir, destPath)
killedBy: cp command execute with multiple sources should copy multiple files to destination directory
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/commands/cp.ts:106:30
     // Handle multiple sources (Unix-style: cp source1 source2 ... destdir)
     if (paths.length > 2) {
       const sources = paths.slice(0, -1)
-      const destPath = paths[paths.length - 1]
+      const destPath = paths[paths.length + 1]
       const resolvedDest = resolvePath(currentDir, destPath)
 
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/commands/cp.ts:110:11
       const resolvedDest = resolvePath(currentDir, destPath)
 
       // Destination must exist and be a directory
-      if (!fs.exists(resolvedDest)) {
+      if (false) {
         return {
           exitCode: 1,
killedBy: cp command execute with multiple sources should return error when destination directory does not exist with multiple sources
statusReason: expected 'cp: target \'nonexistent\' is not a d…' to contain 'No such file or directory'

[Killed] BlockStatement
src/commands/cp.ts:110:37
       const resolvedDest = resolvePath(currentDir, destPath)
 
       // Destination must exist and be a directory
-      if (!fs.exists(resolvedDest)) {
-        return {
-          exitCode: 1,
-          stdout: '',
-          stderr: `cp: target '${resolvedDest}': No such file or directory`,
-        }
-      }
+      if (!fs.exists(resolvedDest)) {}
 
       if (!fs.isDirectory(resolvedDest)) {
killedBy: cp command execute with multiple sources should return error when destination directory does not exist with multiple sources
statusReason: expected 'cp: target \'nonexistent\' is not a d…' to contain 'No such file or directory'

[Killed] BooleanLiteral
src/commands/cp.ts:118:11
         }
       }
 
-      if (!fs.isDirectory(resolvedDest)) {
+      if (fs.isDirectory(resolvedDest)) {
         return {
           exitCode: 1,
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:118:11
         }
       }
 
-      if (!fs.isDirectory(resolvedDest)) {
+      if (false) {
         return {
           exitCode: 1,
killedBy: cp command execute with multiple sources should return error when destination is not a directory with multiple sources
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/commands/cp.ts:126:11
         }
       }
 
-      try {
-        for (const sourcePath of sources) {
-          const resolvedSource = resolvePath(currentDir, sourcePath)
-
-          if (!fs.exists(resolvedSource)) {
-            return {
-              exitCode: 1,
-              stdout: '',
-              stderr: `cp: cannot stat '${resolvedSource}': No such file or directory`,
-            }
-          }
-
-          const basename = getBasename(sourcePath)
-          const finalDest = joinPath(resolvedDest, basename)
-
-          const error = copySingle(resolvedSource, finalDest, sourcePath, fs, recursive)
-          if (error) return error
-        }
-
-        return { exitCode: 0, stdout: '', stderr: '' }
-      } catch (error) {
+      try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error)
         return { exitCode: 1, stdout: '', stderr: `cp: ${message}` }
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/dir1' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/dir1",

[Killed] BlockStatement
src/commands/cp.ts:127:43
       }
 
       try {
-        for (const sourcePath of sources) {
-          const resolvedSource = resolvePath(currentDir, sourcePath)
-
-          if (!fs.exists(resolvedSource)) {
-            return {
-              exitCode: 1,
-              stdout: '',
-              stderr: `cp: cannot stat '${resolvedSource}': No such file or directory`,
-            }
-          }
-
-          const basename = getBasename(sourcePath)
-          const finalDest = joinPath(resolvedDest, basename)
-
-          const error = copySingle(resolvedSource, finalDest, sourcePath, fs, recursive)
-          if (error) return error
-        }
+        for (const sourcePath of sources) {}
 
         return { exitCode: 0, stdout: '', stderr: '' }
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/dir1' ]

Number of calls: 0

[Killed] BooleanLiteral
src/commands/cp.ts:130:15
         for (const sourcePath of sources) {
           const resolvedSource = resolvePath(currentDir, sourcePath)
 
-          if (!fs.exists(resolvedSource)) {
+          if (fs.exists(resolvedSource)) {
             return {
               exitCode: 1,
killedBy: cp command execute copying directory with -r flag should copy multiple directories with -r flag
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] BlockStatement
src/commands/cp.ts:130:43
         for (const sourcePath of sources) {
           const resolvedSource = resolvePath(currentDir, sourcePath)
 
-          if (!fs.exists(resolvedSource)) {
-            return {
-              exitCode: 1,
-              stdout: '',
-              stderr: `cp: cannot stat '${resolvedSource}': No such file or directory`,
-            }
-          }
+          if (!fs.exists(resolvedSource)) {}
 
           const basename = getBasename(sourcePath)

[NoCoverage] BlockStatement
src/commands/cp.ts:146:23
         }
 
         return { exitCode: 0, stdout: '', stderr: '' }
-      } catch (error) {
-        const message = error instanceof Error ? error.message : String(error)
-        return { exitCode: 1, stdout: '', stderr: `cp: ${message}` }
-      }
+      } catch (error) {}
     }
 

[NoCoverage] StringLiteral
src/commands/cp.ts:148:39
         return { exitCode: 0, stdout: '', stderr: '' }
       } catch (error) {
         const message = error instanceof Error ? error.message : String(error)
-        return { exitCode: 1, stdout: '', stderr: `cp: ${message}` }
+        return { exitCode: 1, stdout: "Stryker was here!", stderr: `cp: ${message}` }
       }
     }

[NoCoverage] StringLiteral
src/commands/cp.ts:148:51
         return { exitCode: 0, stdout: '', stderr: '' }
       } catch (error) {
         const message = error instanceof Error ? error.message : String(error)
-        return { exitCode: 1, stdout: '', stderr: `cp: ${message}` }
+        return { exitCode: 1, stdout: '', stderr: `` }
       }
     }

[Killed] BlockStatement
src/commands/cp.ts:159:42
     const resolvedDest = resolvePath(currentDir, destPath)
 
     // Check if source and destination are the same
-    if (resolvedSource === resolvedDest) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `cp: '${sourcePath}' and '${destPath}' are the same file`,
-      }
-    }
+    if (resolvedSource === resolvedDest) {}
 
     // Check if source exists
killedBy: cp command execute when source and destination are the same should return error when copying file to itself
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/commands/cp.ts:159:9
     const resolvedDest = resolvePath(currentDir, destPath)
 
     // Check if source and destination are the same
-    if (resolvedSource === resolvedDest) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: cp command execute when source and destination are the same should return error when copying file to itself
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/commands/cp.ts:163:17
       return {
         exitCode: 1,
         stdout: '',
-        stderr: `cp: '${sourcePath}' and '${destPath}' are the same file`,
+        stderr: ``,
       }
     }
killedBy: cp command execute when source and destination are the same should return error when copying file to itself
statusReason: expected '' to contain 'are the same file'

[Killed] BlockStatement
src/commands/cp.ts:168:37
     }
 
     // Check if source exists
-    if (!fs.exists(resolvedSource)) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `cp: cannot stat '${resolvedSource}': No such file or directory`,
-      }
-    }
+    if (!fs.exists(resolvedSource)) {}
 
     try {
killedBy: cp command execute when source does not exist should return error when source file does not exist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/commands/cp.ts:168:9
     }
 
     // Check if source exists
-    if (!fs.exists(resolvedSource)) {
+    if (fs.exists(resolvedSource)) {
       return {
         exitCode: 1,
killedBy: cp command execute copying file should copy file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/commands/cp.ts:179:37
     try {
       const error = copySingle(resolvedSource, resolvedDest, sourcePath, fs, recursive)
       if (error) return error
-      return { exitCode: 0, stdout: '', stderr: '' }
+      return { exitCode: 0, stdout: "Stryker was here!", stderr: '' }
     } catch (error) {
       const message = error instanceof Error ? error.message : String(error)
killedBy: cp command execute copying file should return empty stdout on success
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
