[Killed] StringLiteral
src/commands/help.ts:15:11
  */
 export function createHelpCommand(registry: CommandRegistry): Command {
   return {
-    name: 'help',
+    name: "",
     description: 'Display help information for commands',
     usage: 'help [command]',
killedBy: help command metadata should have correct name
statusReason: expected '' to be 'help' // Object.is equality

[Killed] StringLiteral
src/commands/help.ts:16:18
 export function createHelpCommand(registry: CommandRegistry): Command {
   return {
     name: 'help',
-    description: 'Display help information for commands',
+    description: "",
     usage: 'help [command]',
 
killedBy: help command metadata should have a description
statusReason: expected '' to be truthy

[Killed] BlockStatement
src/commands/help.ts:23:24
       const commandName = args[0]
 
       // If a specific command is requested
-      if (commandName) {
-        const command = registry.get(commandName)
-
-        if (!command) {
-          return {
-            exitCode: 1,
-            stdout: '',
-            stderr: `help: command '${commandName}' not found`,
-          }
-        }
-
-        // Show detailed help for the command
-        const output = [
-          `${command.name} - ${command.description}`,
-          '',
-          `Usage: ${command.usage}`,
-        ].join('\n')
-
-        return {
-          exitCode: 0,
-          stdout: output,
-          stderr: '',
-        }
-      }
+      if (commandName) {}
 
       // List all commands
killedBy: help command execute with command name argument should show detailed help for specific command
statusReason: expected 'Available commands:\n\n  test1       …' to contain 'test1 [args]'

[Killed] ConditionalExpression
src/commands/help.ts:23:11
       const commandName = args[0]
 
       // If a specific command is requested
-      if (commandName) {
+      if (true) {
         const command = registry.get(commandName)
 
killedBy: help command execute with no arguments (list all commands) should list all registered commands
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/commands/help.ts:30:21
           return {
             exitCode: 1,
             stdout: '',
-            stderr: `help: command '${commandName}' not found`,
+            stderr: ``,
           }
         }
killedBy: help command execute with command name argument should return error for unknown command
statusReason: expected '' to contain 'unknown'

[Killed] ArrayDeclaration
src/commands/help.ts:35:24
         }
 
         // Show detailed help for the command
-        const output = [
-          `${command.name} - ${command.description}`,
-          '',
-          `Usage: ${command.usage}`,
-        ].join('\n')
+        const output = [].join('\n')
 
         return {
killedBy: help command execute with command name argument should show detailed help for specific command
statusReason: expected '' to contain 'test1'

[Killed] StringLiteral
src/commands/help.ts:37:11
         // Show detailed help for the command
         const output = [
           `${command.name} - ${command.description}`,
-          '',
+          "Stryker was here!",
           `Usage: ${command.usage}`,
         ].join('\n')
killedBy: help command output format details should have blank line between description and usage in detailed help
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/commands/help.ts:38:11
         const output = [
           `${command.name} - ${command.description}`,
           '',
-          `Usage: ${command.usage}`,
+          ``,
         ].join('\n')
 
killedBy: help command execute with command name argument should show detailed help for specific command
statusReason: expected 'test1 - Test command 1\n\n' to contain 'test1 [args]'

[Killed] StringLiteral
src/commands/help.ts:44:19
         return {
           exitCode: 0,
           stdout: output,
-          stderr: '',
+          stderr: "Stryker was here!",
         }
       }
killedBy: help command output format details should return empty stderr on success for specific command
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] EqualityOperator
src/commands/help.ts:51:11
       // List all commands
       const commands = registry.list()
 
-      if (commands.length === 0) {
+      if (commands.length !== 0) {
         return {
           exitCode: 0,
killedBy: help command execute with no arguments (list all commands) should list all registered commands
statusReason: expected 'No commands available' to contain 'test1'

[Killed] ConditionalExpression
src/commands/help.ts:51:11
       // List all commands
       const commands = registry.list()
 
-      if (commands.length === 0) {
+      if (false) {
         return {
           exitCode: 0,
killedBy: help command edge cases should handle empty registry
statusReason: expected 'Available commands:\n\n\nType "help <…' to contain 'No commands available'

[Killed] StringLiteral
src/commands/help.ts:55:19
         return {
           exitCode: 0,
           stdout: 'No commands available',
-          stderr: '',
+          stderr: "Stryker was here!",
         }
       }
killedBy: help command edge cases should handle empty registry
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] MethodExpression
src/commands/help.ts:60:30
       }
 
       // Sort commands alphabetically
-      const sortedCommands = [...commands].sort((a, b) =>
-        a.name.localeCompare(b.name)
-      )
+      const sortedCommands = [...commands]
 
       // Format output
killedBy: help command output formatting should sort commands alphabetically
statusReason: expected 48 to be less than 23

[Killed] BlockStatement
src/commands/help.ts:67:41
       // Format output
       const lines = ['Available commands:', '']
 
-      for (const cmd of sortedCommands) {
-        lines.push(`  ${cmd.name.padEnd(12)} ${cmd.description}`)
-      }
+      for (const cmd of sortedCommands) {}
 
       lines.push('')
killedBy: help command execute with no arguments (list all commands) should list all registered commands
statusReason: expected 'Available commands:\n\n\nType "help <…' to contain 'test1'

[Killed] StringLiteral
src/commands/help.ts:68:20
       const lines = ['Available commands:', '']
 
       for (const cmd of sortedCommands) {
-        lines.push(`  ${cmd.name.padEnd(12)} ${cmd.description}`)
+        lines.push(``)
       }
 
killedBy: help command execute with no arguments (list all commands) should list all registered commands
statusReason: expected 'Available commands:\n\n\n\n\nType "he…' to contain 'test1'

[Survived] StringLiteral
src/commands/help.ts:71:18
         lines.push(`  ${cmd.name.padEnd(12)} ${cmd.description}`)
       }
 
-      lines.push('')
+      lines.push("Stryker was here!")
       lines.push('Type "help <command>" for more information.')
 
