[Killed] MethodExpression
src/commands/ls.ts:12:10
  * Sort entries: directories first (alphabetically), then files (alphabetically).
  */
 function sortEntries(entries: FileEntry[]): FileEntry[] {
-  return [...entries].sort((a, b) => {
-    // Directories come before files
-    if (a.type !== b.type) {
-      return a.type === 'directory' ? -1 : 1
-    }
-    // Within same type, sort alphabetically
-    return a.name.localeCompare(b.name)
-  })
+  return [...entries]
 }
 
killedBy: ls command output formatting should sort entries alphabetically
statusReason: expected 'zebra.txt' to be 'alpha.txt' // Object.is equality

[Killed] EqualityOperator
src/commands/ls.ts:14:9
 function sortEntries(entries: FileEntry[]): FileEntry[] {
   return [...entries].sort((a, b) => {
     // Directories come before files
-    if (a.type !== b.type) {
+    if (a.type === b.type) {
       return a.type === 'directory' ? -1 : 1
     }
killedBy: ls command output formatting should sort entries alphabetically
statusReason: expected 'zebra.txt' to be 'alpha.txt' // Object.is equality

[Killed] ConditionalExpression
src/commands/ls.ts:14:9
 function sortEntries(entries: FileEntry[]): FileEntry[] {
   return [...entries].sort((a, b) => {
     // Directories come before files
-    if (a.type !== b.type) {
+    if (true) {
       return a.type === 'directory' ? -1 : 1
     }
killedBy: ls command output formatting should sort entries alphabetically
statusReason: expected 'zebra.txt' to be 'alpha.txt' // Object.is equality

[Killed] ConditionalExpression
src/commands/ls.ts:15:14
   return [...entries].sort((a, b) => {
     // Directories come before files
     if (a.type !== b.type) {
-      return a.type === 'directory' ? -1 : 1
+      return false ? -1 : 1
     }
     // Within same type, sort alphabetically
killedBy: ls command output formatting should list directories before files when sorting
statusReason: expected 'file.txt' to be 'bin/' // Object.is equality

[Killed] UnaryOperator
src/commands/ls.ts:15:39
   return [...entries].sort((a, b) => {
     // Directories come before files
     if (a.type !== b.type) {
-      return a.type === 'directory' ? -1 : 1
+      return a.type === 'directory' ? +1 : 1
     }
     // Within same type, sort alphabetically
killedBy: ls command output formatting should list directories before files when sorting
statusReason: expected 'file.txt' to be 'bin/' // Object.is equality

[Killed] EqualityOperator
src/commands/ls.ts:27:10
  * Appends / to directory names.
  */
 function formatEntry(entry: FileEntry): string {
-  return entry.type === 'directory' ? `${entry.name}/` : entry.name
+  return entry.type !== 'directory' ? `${entry.name}/` : entry.name
 }
 
killedBy: ls command output formatting should sort entries alphabetically
statusReason: expected 'alpha.txt/' to be 'alpha.txt' // Object.is equality

[Killed] ConditionalExpression
src/commands/ls.ts:27:10
  * Appends / to directory names.
  */
 function formatEntry(entry: FileEntry): string {
-  return entry.type === 'directory' ? `${entry.name}/` : entry.name
+  return true ? `${entry.name}/` : entry.name
 }
 
killedBy: ls command output formatting should sort entries alphabetically
statusReason: expected 'alpha.txt/' to be 'alpha.txt' // Object.is equality

[Killed] LogicalOperator
src/commands/ls.ts:41:24
 
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Default to current directory if no path provided
-    const targetPath = args[0] ?? fs.getCurrentDirectory()
+    const targetPath = args[0] && fs.getCurrentDirectory()
 
     // Resolve the path relative to current directory
killedBy: ls command execute with no arguments (current directory) should list current directory when no args provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BlockStatement
src/commands/ls.ts:48:35
     const resolvedPath = resolvePath(currentDir, targetPath)
 
     // Check if path exists
-    if (!fs.exists(resolvedPath)) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `ls: ${resolvedPath}: no such file or directory`,
-      }
-    }
+    if (!fs.exists(resolvedPath)) {}
 
     // If path is a file, just show the filename
killedBy: ls command execute with invalid path should return error when path does not exist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/commands/ls.ts:57:9
     }
 
     // If path is a file, just show the filename
-    if (fs.isFile(resolvedPath)) {
+    if (false) {
       return {
         exitCode: 0,
killedBy: ls command execute with path argument should show file info when path is a file
statusReason: expected '' to be 'file.txt' // Object.is equality

[Killed] ConditionalExpression
src/commands/ls.ts:57:9
     }
 
     // If path is a file, just show the filename
-    if (fs.isFile(resolvedPath)) {
+    if (true) {
       return {
         exitCode: 0,
killedBy: ls command execute with no arguments (current directory) should list current directory when no args provided
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user' ]

Number of calls: 0
