[Killed] BlockStatement
src/commands/mv.ts:24:32
 
   // List and copy contents
   const entries = fs.listDirectory(srcPath)
-  for (const entry of entries) {
-    const srcEntryPath = joinPath(srcPath, entry.name)
-    const destEntryPath = joinPath(destPath, entry.name)
-
-    if (entry.type === 'directory') {
-      const subPaths = copyDirectoryRecursive(srcEntryPath, destEntryPath, fs)
-      copiedPaths.push(...subPaths)
-      copiedPaths.push(srcEntryPath) // Add directory after its contents
-    } else {
-      const content = fs.readFile(srcEntryPath)
-      fs.writeFile(destEntryPath, content)
-      copiedPaths.push(srcEntryPath)
-    }
-  }
+  for (const entry of entries) {}
 
   return copiedPaths
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/subdir' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/subdir",

[Killed] BlockStatement
src/commands/mv.ts:28:37
     const srcEntryPath = joinPath(srcPath, entry.name)
     const destEntryPath = joinPath(destPath, entry.name)
 
-    if (entry.type === 'directory') {
-      const subPaths = copyDirectoryRecursive(srcEntryPath, destEntryPath, fs)
-      copiedPaths.push(...subPaths)
-      copiedPaths.push(srcEntryPath) // Add directory after its contents
-    } else {
+    if (entry.type === 'directory') {} else {
       const content = fs.readFile(srcEntryPath)
       fs.writeFile(destEntryPath, content)
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir/subdir' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/subdir",

[Killed] BlockStatement
src/commands/mv.ts:32:12
       const subPaths = copyDirectoryRecursive(srcEntryPath, destEntryPath, fs)
       copiedPaths.push(...subPaths)
       copiedPaths.push(srcEntryPath) // Add directory after its contents
-    } else {
-      const content = fs.readFile(srcEntryPath)
-      fs.writeFile(destEntryPath, content)
-      copiedPaths.push(srcEntryPath)
-    }
+    } else {}
   }
 
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mv.ts:45:80
 /**
  * Delete paths in order (files first, then directories from deepest to shallowest).
  */
-function deletePaths(paths: string[], rootPath: string, fs: IFileSystem): void {
-  // Delete in order (files and subdirs first, root last)
-  for (const path of paths) {
-    fs.delete(path)
-  }
-  // Delete the root directory
-  fs.delete(rootPath)
-}
+function deletePaths(paths: string[], rootPath: string, fs: IFileSystem): void {}
 
 /**
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/srcdir/file1.txt' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mv.ts:47:29
  */
 function deletePaths(paths: string[], rootPath: string, fs: IFileSystem): void {
   // Delete in order (files and subdirs first, root last)
-  for (const path of paths) {
-    fs.delete(path)
-  }
+  for (const path of paths) {}
   // Delete the root directory
   fs.delete(rootPath)
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/srcdir/file1.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/srcdir/file1.txt",

[Killed] BlockStatement
src/commands/mv.ts:64:39
   fs: IFileSystem
 ): void {
   // Check if source is a directory
-  if (fs.isDirectory(resolvedSource)) {
-    // Copy directory recursively
-    const copiedPaths = copyDirectoryRecursive(resolvedSource, resolvedDest, fs)
-    // Delete source after successful copy
-    deletePaths(copiedPaths, resolvedSource, fs)
-    return
-  }
+  if (fs.isDirectory(resolvedSource)) {}
 
   // Source is a file
killedBy: mv command execute moving directory recursively should move directory and its contents
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/destdir' ]

Number of calls: 0

[Killed] LogicalOperator
src/commands/mv.ts:77:7
 
   // Check if destination is a directory
   let finalDest = resolvedDest
-  if (fs.exists(resolvedDest) && fs.isDirectory(resolvedDest)) {
+  if (fs.exists(resolvedDest) || fs.isDirectory(resolvedDest)) {
     // Move into directory with same name
     const basename = getBasename(sourcePath)
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/dest.txt', …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/dest.txt",

[Killed] StringLiteral
src/commands/mv.ts:94:9
  * Moves/renames files and directories.
  */
 export const mv: Command = {
-  name: 'mv',
+  name: "",
   description: 'Move or rename files and directories',
   usage: 'mv <source>... <destination>',
killedBy: mv command metadata should have correct name
statusReason: expected '' to be 'mv' // Object.is equality

[Killed] StringLiteral
src/commands/mv.ts:96:10
 export const mv: Command = {
   name: 'mv',
   description: 'Move or rename files and directories',
-  usage: 'mv <source>... <destination>',
+  usage: "",
 
   execute(args: string[], fs: IFileSystem): CommandResult {
killedBy: mv command metadata should have usage information
statusReason: expected '' to be truthy

[Killed] BlockStatement
src/commands/mv.ts:100:28
 
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Check for required arguments
-    if (args.length === 0) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: 'mv: missing file operand',
-      }
-    }
+    if (args.length === 0) {}
 
     if (args.length === 1) {
killedBy: mv command execute with missing arguments should return error when no arguments provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/commands/mv.ts:100:9
 
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Check for required arguments
-    if (args.length === 0) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: mv command execute with missing arguments should return error when no arguments provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
src/commands/mv.ts:108:9
       }
     }
 
-    if (args.length === 1) {
+    if (args.length !== 1) {
       return {
         exitCode: 1,
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/commands/mv.ts:108:28
       }
     }
 
-    if (args.length === 1) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `mv: missing destination file operand after '${args[0]}'`,
-      }
-    }
+    if (args.length === 1) {}
 
     const currentDir = fs.getCurrentDirectory()
killedBy: mv command execute with missing arguments should return error when only source provided
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
src/commands/mv.ts:119:9
     const currentDir = fs.getCurrentDirectory()
 
     // Handle multiple sources (Unix-style: mv source1 source2 ... destdir)
-    if (args.length > 2) {
+    if (args.length >= 2) {
       const sources = args.slice(0, -1)
       const destPath = args[args.length - 1]
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/commands/mv.ts:119:9
     const currentDir = fs.getCurrentDirectory()
 
     // Handle multiple sources (Unix-style: mv source1 source2 ... destdir)
-    if (args.length > 2) {
+    if (args.length <= 2) {
       const sources = args.slice(0, -1)
       const destPath = args[args.length - 1]
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UnaryOperator
src/commands/mv.ts:120:37
 
     // Handle multiple sources (Unix-style: mv source1 source2 ... destdir)
     if (args.length > 2) {
-      const sources = args.slice(0, -1)
+      const sources = args.slice(0, +1)
       const destPath = args[args.length - 1]
       const resolvedDest = resolvePath(currentDir, destPath)
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/file2.txt",

[Survived] MethodExpression
src/commands/mv.ts:120:23
 
     // Handle multiple sources (Unix-style: mv source1 source2 ... destdir)
     if (args.length > 2) {
-      const sources = args.slice(0, -1)
+      const sources = args
       const destPath = args[args.length - 1]
       const resolvedDest = resolvePath(currentDir, destPath)

[Killed] ArithmeticOperator
src/commands/mv.ts:121:29
     // Handle multiple sources (Unix-style: mv source1 source2 ... destdir)
     if (args.length > 2) {
       const sources = args.slice(0, -1)
-      const destPath = args[args.length - 1]
+      const destPath = args[args.length + 1]
       const resolvedDest = resolvePath(currentDir, destPath)
 
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BooleanLiteral
src/commands/mv.ts:125:11
       const resolvedDest = resolvePath(currentDir, destPath)
 
       // Destination must exist and be a directory
-      if (!fs.exists(resolvedDest)) {
+      if (fs.exists(resolvedDest)) {
         return {
           exitCode: 1,
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/commands/mv.ts:125:37
       const resolvedDest = resolvePath(currentDir, destPath)
 
       // Destination must exist and be a directory
-      if (!fs.exists(resolvedDest)) {
-        return {
-          exitCode: 1,
-          stdout: '',
-          stderr: `mv: target '${resolvedDest}': No such file or directory`,
-        }
-      }
+      if (!fs.exists(resolvedDest)) {}
 
       if (!fs.isDirectory(resolvedDest)) {
killedBy: mv command execute with multiple sources should return error when destination directory does not exist with multiple sources
statusReason: expected 'mv: target \'nonexistent\' is not a d…' to contain 'No such file or directory'

[Killed] BlockStatement
src/commands/mv.ts:133:42
         }
       }
 
-      if (!fs.isDirectory(resolvedDest)) {
-        return {
-          exitCode: 1,
-          stdout: '',
-          stderr: `mv: target '${destPath}' is not a directory`,
-        }
-      }
+      if (!fs.isDirectory(resolvedDest)) {}
 
       try {
killedBy: mv command execute with multiple sources should return error when destination is not a directory with multiple sources
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/commands/mv.ts:141:11
         }
       }
 
-      try {
-        for (const sourcePath of sources) {
-          const resolvedSource = resolvePath(currentDir, sourcePath)
-
-          if (!fs.exists(resolvedSource)) {
-            return {
-              exitCode: 1,
-              stdout: '',
-              stderr: `mv: cannot stat '${resolvedSource}': No such file or directory`,
-            }
-          }
-
-          const basename = getBasename(sourcePath)
-          const finalDest = joinPath(resolvedDest, basename)
-
-          moveSingle(resolvedSource, finalDest, sourcePath, fs)
-        }
-
-        return { exitCode: 0, stdout: '', stderr: '' }
-      } catch (error) {
+      try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error)
         return { exitCode: 1, stdout: '', stderr: `mv: ${message}` }
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/destdir/file1.txt",

[Killed] BlockStatement
src/commands/mv.ts:142:43
       }
 
       try {
-        for (const sourcePath of sources) {
-          const resolvedSource = resolvePath(currentDir, sourcePath)
-
-          if (!fs.exists(resolvedSource)) {
-            return {
-              exitCode: 1,
-              stdout: '',
-              stderr: `mv: cannot stat '${resolvedSource}': No such file or directory`,
-            }
-          }
-
-          const basename = getBasename(sourcePath)
-          const finalDest = joinPath(resolvedDest, basename)
-
-          moveSingle(resolvedSource, finalDest, sourcePath, fs)
-        }
+        for (const sourcePath of sources) {}
 
         return { exitCode: 0, stdout: '', stderr: '' }
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/commands/mv.ts:145:15
         for (const sourcePath of sources) {
           const resolvedSource = resolvePath(currentDir, sourcePath)
 
-          if (!fs.exists(resolvedSource)) {
+          if (true) {
             return {
               exitCode: 1,
killedBy: mv command execute with multiple sources should move multiple files to destination directory
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] StringLiteral
src/commands/mv.ts:149:23
             return {
               exitCode: 1,
               stdout: '',
-              stderr: `mv: cannot stat '${resolvedSource}': No such file or directory`,
+              stderr: ``,
             }
           }

[Survived] StringLiteral
src/commands/mv.ts:159:51
           moveSingle(resolvedSource, finalDest, sourcePath, fs)
         }
 
-        return { exitCode: 0, stdout: '', stderr: '' }
+        return { exitCode: 0, stdout: '', stderr: "Stryker was here!" }
       } catch (error) {
         const message = error instanceof Error ? error.message : String(error)

[NoCoverage] BlockStatement
src/commands/mv.ts:160:23
         }
 
         return { exitCode: 0, stdout: '', stderr: '' }
-      } catch (error) {
-        const message = error instanceof Error ? error.message : String(error)
-        return { exitCode: 1, stdout: '', stderr: `mv: ${message}` }
-      }
+      } catch (error) {}
     }
 

[NoCoverage] StringLiteral
src/commands/mv.ts:162:51
         return { exitCode: 0, stdout: '', stderr: '' }
       } catch (error) {
         const message = error instanceof Error ? error.message : String(error)
-        return { exitCode: 1, stdout: '', stderr: `mv: ${message}` }
+        return { exitCode: 1, stdout: '', stderr: `` }
       }
     }

[Killed] EqualityOperator
src/commands/mv.ts:173:9
     const resolvedDest = resolvePath(currentDir, destPath)
 
     // Check if source and destination are the same
-    if (resolvedSource === resolvedDest) {
+    if (resolvedSource !== resolvedDest) {
       return {
         exitCode: 1,
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/commands/mv.ts:173:42
     const resolvedDest = resolvePath(currentDir, destPath)
 
     // Check if source and destination are the same
-    if (resolvedSource === resolvedDest) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `mv: '${sourcePath}' and '${destPath}' are the same file`,
-      }
-    }
+    if (resolvedSource === resolvedDest) {}
 
     // Check if source exists
killedBy: mv command execute when source and destination are the same should return error when moving file to itself
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/commands/mv.ts:177:17
       return {
         exitCode: 1,
         stdout: '',
-        stderr: `mv: '${sourcePath}' and '${destPath}' are the same file`,
+        stderr: ``,
       }
     }
killedBy: mv command execute when source and destination are the same should return error when moving file to itself
statusReason: expected '' to contain 'are the same file'

[Killed] ConditionalExpression
src/commands/mv.ts:182:9
     }
 
     // Check if source exists
-    if (!fs.exists(resolvedSource)) {
+    if (false) {
       return {
         exitCode: 1,
killedBy: mv command execute when source does not exist should return error when source file does not exist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/commands/mv.ts:182:37
     }
 
     // Check if source exists
-    if (!fs.exists(resolvedSource)) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: `mv: cannot stat '${resolvedSource}': No such file or directory`,
-      }
-    }
+    if (!fs.exists(resolvedSource)) {}
 
     try {
killedBy: mv command execute when source does not exist should return error when source file does not exist
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/commands/mv.ts:192:37
 
     try {
       moveSingle(resolvedSource, resolvedDest, sourcePath, fs)
-      return { exitCode: 0, stdout: '', stderr: '' }
+      return { exitCode: 0, stdout: "Stryker was here!", stderr: '' }
     } catch (error) {
       const message = error instanceof Error ? error.message : String(error)
killedBy: mv command execute moving file should return empty stdout on success
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/commands/mv.ts:192:49
 
     try {
       moveSingle(resolvedSource, resolvedDest, sourcePath, fs)
-      return { exitCode: 0, stdout: '', stderr: '' }
+      return { exitCode: 0, stdout: '', stderr: "Stryker was here!" }
     } catch (error) {
       const message = error instanceof Error ? error.message : String(error)
killedBy: mv command execute moving file should return empty stderr on success
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
