[Killed] StringLiteral
src/commands/pwd.ts:13:16
  */
 export const pwd: Command = {
   name: 'pwd',
-  description: 'Print the current working directory',
+  description: "",
   usage: 'pwd',
 
killedBy: pwd command metadata should have a description
statusReason: expected '' to be truthy
