[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:43:9
    * Resolve a path to an absolute path based on current directory.
    */
   function resolvePath(path: string): string {
-    if (isAbsolutePath(path)) {
+    if (true) {
       return normalizePath(path)
     }
killedBy: createFileSystemAdapter path normalization should handle current directory in relative paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/test.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/test.txt",

[Survived] ConditionalExpression
src/createFileSystemAdapter.ts:43:9
    * Resolve a path to an absolute path based on current directory.
    */
   function resolvePath(path: string): string {
-    if (isAbsolutePath(path)) {
+    if (false) {
       return normalizePath(path)
     }

[Killed] BlockStatement
src/createFileSystemAdapter.ts:54:45
       return currentDirectory
     },
 
-    setCurrentDirectory(path: string): void {
-      const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
-        throw new Error(`Directory not found: ${resolved}`)
-      }
-      if (!external.isDirectory(resolved)) {
-        throw new Error(`Not a directory: ${resolved}`)
-      }
-      currentDirectory = resolved
-    },
+    setCurrentDirectory(path: string): void {},
 
     exists(path: string): boolean {
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: expected '/' to be '/home' // Object.is equality

[Killed] BlockStatement
src/createFileSystemAdapter.ts:56:39
 
     setCurrentDirectory(path: string): void {
       const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
-        throw new Error(`Directory not found: ${resolved}`)
-      }
+      if (!external.exists(resolved)) {}
       if (!external.isDirectory(resolved)) {
         throw new Error(`Not a directory: ${resolved}`)
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should throw error when setting to non-existent path
statusReason: expected [Function] to throw error including 'Directory not found: /nonexistent' but got 'Not a directory: /nonexistent'

[Killed] BooleanLiteral
src/createFileSystemAdapter.ts:56:11
 
     setCurrentDirectory(path: string): void {
       const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
+      if (external.exists(resolved)) {
         throw new Error(`Directory not found: ${resolved}`)
       }
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: Directory not found: /home

[Killed] BooleanLiteral
src/createFileSystemAdapter.ts:59:11
       if (!external.exists(resolved)) {
         throw new Error(`Directory not found: ${resolved}`)
       }
-      if (!external.isDirectory(resolved)) {
+      if (external.isDirectory(resolved)) {
         throw new Error(`Not a directory: ${resolved}`)
       }
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: Not a directory: /home

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:59:11
       if (!external.exists(resolved)) {
         throw new Error(`Directory not found: ${resolved}`)
       }
-      if (!external.isDirectory(resolved)) {
+      if (true) {
         throw new Error(`Not a directory: ${resolved}`)
       }
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: Not a directory: /home

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:72:11
 
     isDirectory(path: string): boolean {
       const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
+      if (true) {
         return false
       }
killedBy: createFileSystemAdapter isDirectory should return true for directories
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/createFileSystemAdapter.ts:73:16
     isDirectory(path: string): boolean {
       const resolved = resolvePath(path)
       if (!external.exists(resolved)) {
-        return false
+        return true
       }
       return external.isDirectory(resolved)
killedBy: createFileSystemAdapter isDirectory should return false for non-existent paths
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/createFileSystemAdapter.ts:80:39
 
     isFile(path: string): boolean {
       const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
-        return false
-      }
+      if (!external.exists(resolved)) {}
       return !external.isDirectory(resolved)
     },
killedBy: createFileSystemAdapter isFile should return false for non-existent paths
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/createFileSystemAdapter.ts:83:14
       if (!external.exists(resolved)) {
         return false
       }
-      return !external.isDirectory(resolved)
+      return external.isDirectory(resolved)
     },
 
killedBy: createFileSystemAdapter isFile should return true for files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:88:11
 
     listDirectory(path: string): FileEntry[] {
       const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
+      if (false) {
         throw new Error(`Directory not found: ${resolved}`)
       }
killedBy: createFileSystemAdapter listDirectory should throw error for non-existent directory
statusReason: expected [Function] to throw error including 'Directory not found: /nonexistent' but got 'Not a directory: /nonexistent'

[Killed] StringLiteral
src/createFileSystemAdapter.ts:110:25
     readFile(path: string): string {
       const resolved = resolvePath(path)
       if (!external.exists(resolved)) {
-        throw new Error(`File not found: ${resolved}`)
+        throw new Error(``)
       }
       if (external.isDirectory(resolved)) {
killedBy: createFileSystemAdapter readFile should throw error for non-existent file
statusReason: expected [Function] to throw error including 'File not found: /missing.txt' but got ''

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:112:11
       if (!external.exists(resolved)) {
         throw new Error(`File not found: ${resolved}`)
       }
-      if (external.isDirectory(resolved)) {
+      if (false) {
         throw new Error(`Not a file: ${resolved}`)
       }
killedBy: createFileSystemAdapter readFile should throw error when path is a directory
statusReason: expected [Function] to throw error including 'Not a file: /mydir' but got 'File not found: /mydir'

[Killed] BlockStatement
src/createFileSystemAdapter.ts:112:43
       if (!external.exists(resolved)) {
         throw new Error(`File not found: ${resolved}`)
       }
-      if (external.isDirectory(resolved)) {
-        throw new Error(`Not a file: ${resolved}`)
-      }
+      if (external.isDirectory(resolved)) {}
       const content = external.readFile(resolved)
       if (content === null) {
killedBy: createFileSystemAdapter readFile should throw error when path is a directory
statusReason: expected [Function] to throw error including 'Not a file: /mydir' but got 'File not found: /mydir'

[Killed] StringLiteral
src/createFileSystemAdapter.ts:117:25
       }
       const content = external.readFile(resolved)
       if (content === null) {
-        throw new Error(`File not found: ${resolved}`)
+        throw new Error(``)
       }
       return content
killedBy: createFileSystemAdapter readFile should throw error when external readFile returns null
statusReason: expected [Function] to throw error including 'File not found: /ghost.txt' but got ''

[Killed] BlockStatement
src/createFileSystemAdapter.ts:122:52
       return content
     },
 
-    writeFile(path: string, content: string): void {
-      const resolved = resolvePath(path)
-      if (external.exists(resolved)) {
-        if (external.isDirectory(resolved)) {
-          throw new Error(`Cannot write to directory: ${resolved}`)
-        }
-        external.writeFile(resolved, content)
-      } else {
-        external.createFile(resolved, content)
-      }
-    },
+    writeFile(path: string, content: string): void {},
 
     createDirectory(path: string): void {
killedBy: createFileSystemAdapter writeFile should write content to existing file
statusReason: expected "vi.fn()" to be called with arguments: [ '/test.txt', 'new content' ]

Number of calls: 0

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:124:11
 
     writeFile(path: string, content: string): void {
       const resolved = resolvePath(path)
-      if (external.exists(resolved)) {
+      if (true) {
         if (external.isDirectory(resolved)) {
           throw new Error(`Cannot write to directory: ${resolved}`)
killedBy: createFileSystemAdapter writeFile should create file if it does not exist
statusReason: expected "vi.fn()" to be called with arguments: [ '/new.txt', 'content' ]

Number of calls: 0

[Killed] BlockStatement
src/createFileSystemAdapter.ts:124:38
 
     writeFile(path: string, content: string): void {
       const resolved = resolvePath(path)
-      if (external.exists(resolved)) {
-        if (external.isDirectory(resolved)) {
-          throw new Error(`Cannot write to directory: ${resolved}`)
-        }
-        external.writeFile(resolved, content)
-      } else {
+      if (external.exists(resolved)) {} else {
         external.createFile(resolved, content)
       }
killedBy: createFileSystemAdapter writeFile should write content to existing file
statusReason: expected "vi.fn()" to be called with arguments: [ '/test.txt', 'new content' ]

Number of calls: 0

[Killed] BlockStatement
src/createFileSystemAdapter.ts:125:45
     writeFile(path: string, content: string): void {
       const resolved = resolvePath(path)
       if (external.exists(resolved)) {
-        if (external.isDirectory(resolved)) {
-          throw new Error(`Cannot write to directory: ${resolved}`)
-        }
+        if (external.isDirectory(resolved)) {}
         external.writeFile(resolved, content)
       } else {
killedBy: createFileSystemAdapter writeFile should throw error when path is a directory
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:125:13
     writeFile(path: string, content: string): void {
       const resolved = resolvePath(path)
       if (external.exists(resolved)) {
-        if (external.isDirectory(resolved)) {
+        if (false) {
           throw new Error(`Cannot write to directory: ${resolved}`)
         }
killedBy: createFileSystemAdapter writeFile should throw error when path is a directory
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/createFileSystemAdapter.ts:129:14
           throw new Error(`Cannot write to directory: ${resolved}`)
         }
         external.writeFile(resolved, content)
-      } else {
-        external.createFile(resolved, content)
-      }
+      } else {}
     },
 
killedBy: createFileSystemAdapter writeFile should create file if it does not exist
statusReason: expected "vi.fn()" to be called with arguments: [ '/new.txt', 'content' ]

Number of calls: 0

[Killed] BlockStatement
src/createFileSystemAdapter.ts:134:41
       }
     },
 
-    createDirectory(path: string): void {
-      const resolved = resolvePath(path)
-      if (external.exists(resolved)) {
-        throw new Error(`Path already exists: ${resolved}`)
-      }
-      const parent = getParentPath(resolved)
-      if (!external.exists(parent)) {
-        throw new Error(`Parent directory not found: ${parent}`)
-      }
-      external.createFolder(resolved)
-    },
+    createDirectory(path: string): void {},
 
     delete(path: string): void {
killedBy: createFileSystemAdapter createDirectory should create a directory
statusReason: expected "vi.fn()" to be called with arguments: [ '/newdir' ]

Number of calls: 0

[Killed] BlockStatement
src/createFileSystemAdapter.ts:136:38
 
     createDirectory(path: string): void {
       const resolved = resolvePath(path)
-      if (external.exists(resolved)) {
-        throw new Error(`Path already exists: ${resolved}`)
-      }
+      if (external.exists(resolved)) {}
       const parent = getParentPath(resolved)
       if (!external.exists(parent)) {
killedBy: createFileSystemAdapter createDirectory should throw error if path already exists
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/createFileSystemAdapter.ts:140:37
         throw new Error(`Path already exists: ${resolved}`)
       }
       const parent = getParentPath(resolved)
-      if (!external.exists(parent)) {
-        throw new Error(`Parent directory not found: ${parent}`)
-      }
+      if (!external.exists(parent)) {}
       external.createFolder(resolved)
     },
killedBy: createFileSystemAdapter createDirectory should throw error if parent does not exist
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:140:11
         throw new Error(`Path already exists: ${resolved}`)
       }
       const parent = getParentPath(resolved)
-      if (!external.exists(parent)) {
+      if (true) {
         throw new Error(`Parent directory not found: ${parent}`)
       }
killedBy: createFileSystemAdapter createDirectory should create a directory
statusReason: Parent directory not found: /

[Killed] StringLiteral
src/createFileSystemAdapter.ts:141:25
       }
       const parent = getParentPath(resolved)
       if (!external.exists(parent)) {
-        throw new Error(`Parent directory not found: ${parent}`)
+        throw new Error(``)
       }
       external.createFolder(resolved)
killedBy: createFileSystemAdapter createDirectory should throw error if parent does not exist
statusReason: expected [Function] to throw error including 'Parent directory not found: /missing' but got ''

[Killed] BlockStatement
src/createFileSystemAdapter.ts:146:32
       external.createFolder(resolved)
     },
 
-    delete(path: string): void {
-      const resolved = resolvePath(path)
-      if (!external.exists(resolved)) {
-        throw new Error(`Path not found: ${resolved}`)
-      }
-      if (external.isDirectory(resolved)) {
-        const entries = external.listDirectory(resolved)
-        if (entries.length > 0) {
-          throw new Error(`Directory not empty: ${resolved}`)
-        }
-        external.deleteFolder(resolved)
-      } else {
-        external.deleteFile(resolved)
-      }
-    },
+    delete(path: string): void {},
   }
 }
killedBy: createFileSystemAdapter delete should delete a file
statusReason: expected "vi.fn()" to be called with arguments: [ '/file.txt' ]

Number of calls: 0

[Killed] ConditionalExpression
src/createFileSystemAdapter.ts:151:11
       if (!external.exists(resolved)) {
         throw new Error(`Path not found: ${resolved}`)
       }
-      if (external.isDirectory(resolved)) {
+      if (true) {
         const entries = external.listDirectory(resolved)
         if (entries.length > 0) {
killedBy: createFileSystemAdapter delete should delete a file
statusReason: expected "vi.fn()" to be called with arguments: [ '/file.txt' ]

Number of calls: 0

[Killed] EqualityOperator
src/createFileSystemAdapter.ts:153:13
       }
       if (external.isDirectory(resolved)) {
         const entries = external.listDirectory(resolved)
-        if (entries.length > 0) {
+        if (entries.length >= 0) {
           throw new Error(`Directory not empty: ${resolved}`)
         }
killedBy: createFileSystemAdapter delete should delete an empty directory
statusReason: Directory not empty: /emptydir

[Killed] EqualityOperator
src/createFileSystemAdapter.ts:153:13
       }
       if (external.isDirectory(resolved)) {
         const entries = external.listDirectory(resolved)
-        if (entries.length > 0) {
+        if (entries.length <= 0) {
           throw new Error(`Directory not empty: ${resolved}`)
         }
killedBy: createFileSystemAdapter delete should delete an empty directory
statusReason: Directory not empty: /emptydir

[Killed] BlockStatement
src/createFileSystemAdapter.ts:157:14
           throw new Error(`Directory not empty: ${resolved}`)
         }
         external.deleteFolder(resolved)
-      } else {
-        external.deleteFile(resolved)
-      }
+      } else {}
     },
   }
killedBy: createFileSystemAdapter delete should delete a file
statusReason: expected "vi.fn()" to be called with arguments: [ '/file.txt' ]

Number of calls: 0
