[Killed] StringLiteral
src/index.ts:8:24
  * Provides filesystem abstractions, command registry, and built-in commands.
  */
 
-export const VERSION = '0.0.1'
+export const VERSION = ""
 
 // Types
killedBy: shell-core package exports VERSION constant
statusReason: expected '' to be '0.0.1' // Object.is equality
