[Survived] MethodExpression
src/parseCommand.ts:18:19
  */
 export function parseCommand(input: string): ParsedCommand {
   const raw = input
-  const trimmed = input.trim()
+  const trimmed = input
 
   if (!trimmed) {

[Killed] BooleanLiteral
src/parseCommand.ts:20:7
   const raw = input
   const trimmed = input.trim()
 
-  if (!trimmed) {
+  if (trimmed) {
     return { command: '', args: [], raw }
   }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:20:7
   const raw = input
   const trimmed = input.trim()
 
-  if (!trimmed) {
+  if (true) {
     return { command: '', args: [], raw }
   }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] BooleanLiteral
src/parseCommand.ts:26:23
 
   const tokens: string[] = []
   let current = ''
-  let inDoubleQuote = false
+  let inDoubleQuote = true
   let inSingleQuote = false
   let escaped = false
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected 'cd /home' to be 'cd' // Object.is equality

[Killed] BooleanLiteral
src/parseCommand.ts:27:23
   const tokens: string[] = []
   let current = ''
   let inDoubleQuote = false
-  let inSingleQuote = false
+  let inSingleQuote = true
   let escaped = false
   let hasQuotedContent = false // Track if current token included quotes
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected 'cd /home' to be 'cd' // Object.is equality

[Survived] BooleanLiteral
src/parseCommand.ts:28:17
   let current = ''
   let inDoubleQuote = false
   let inSingleQuote = false
-  let escaped = false
+  let escaped = true
   let hasQuotedContent = false // Track if current token included quotes
 

[Survived] BooleanLiteral
src/parseCommand.ts:29:26
   let inDoubleQuote = false
   let inSingleQuote = false
   let escaped = false
-  let hasQuotedContent = false // Track if current token included quotes
+  let hasQuotedContent = true // Track if current token included quotes
 
   for (let i = 0; i < trimmed.length; i++) {

[Killed] ConditionalExpression
src/parseCommand.ts:31:19
   let escaped = false
   let hasQuotedContent = false // Track if current token included quotes
 
-  for (let i = 0; i < trimmed.length; i++) {
+  for (let i = 0; false; i++) {
     const char = trimmed[i]
 
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] EqualityOperator
src/parseCommand.ts:31:19
   let escaped = false
   let hasQuotedContent = false // Track if current token included quotes
 
-  for (let i = 0; i < trimmed.length; i++) {
+  for (let i = 0; i >= trimmed.length; i++) {
     const char = trimmed[i]
 
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] BlockStatement
src/parseCommand.ts:35:18
     const char = trimmed[i]
 
     // Handle escape sequences
-    if (escaped) {
-      current += char
-      escaped = false
-      continue
-    }
+    if (escaped) {}
 
     // Start escape sequence
killedBy: parseCommand escape sequences should handle escaped spaces
statusReason: expected [ 'my', 'folder\' ] to deeply equal [ 'my folder' ]

[Killed] ConditionalExpression
src/parseCommand.ts:35:9
     const char = trimmed[i]
 
     // Handle escape sequences
-    if (escaped) {
+    if (false) {
       current += char
       escaped = false
killedBy: parseCommand escape sequences should handle escaped spaces
statusReason: expected [ 'my', 'folder\' ] to deeply equal [ 'my folder' ]

[Killed] BooleanLiteral
src/parseCommand.ts:37:17
     // Handle escape sequences
     if (escaped) {
       current += char
-      escaped = false
+      escaped = true
       continue
     }
killedBy: parseCommand escape sequences should handle escaped spaces
statusReason: expected [ 'my folder\' ] to deeply equal [ 'my folder' ]

[Killed] ConditionalExpression
src/parseCommand.ts:42:9
     }
 
     // Start escape sequence
-    if (char === '\\' && !inSingleQuote) {
+    if (false) {
       escaped = true
       continue
killedBy: parseCommand escape sequences should handle escaped spaces
statusReason: expected [ 'my\', 'folder' ] to deeply equal [ 'my folder' ]

[Killed] LogicalOperator
src/parseCommand.ts:42:9
     }
 
     // Start escape sequence
-    if (char === '\\' && !inSingleQuote) {
+    if (char === '\\' || !inSingleQuote) {
       escaped = true
       continue
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected 's' to be 'ls' // Object.is equality

[Killed] BooleanLiteral
src/parseCommand.ts:43:17
 
     // Start escape sequence
     if (char === '\\' && !inSingleQuote) {
-      escaped = true
+      escaped = false
       continue
     }
killedBy: parseCommand escape sequences should handle escaped spaces
statusReason: expected [ 'my', 'folder' ] to deeply equal [ 'my folder' ]

[Killed] BooleanLiteral
src/parseCommand.ts:48:25
     }
 
     // Handle double quotes
-    if (char === '"' && !inSingleQuote) {
+    if (char === '"' && inSingleQuote) {
       inDoubleQuote = !inDoubleQuote
       hasQuotedContent = true
killedBy: parseCommand quoted arguments should handle double-quoted argument with spaces
statusReason: expected [ '"hello', 'world"' ] to deeply equal [ 'hello world' ]

[Killed] ConditionalExpression
src/parseCommand.ts:48:9
     }
 
     // Handle double quotes
-    if (char === '"' && !inSingleQuote) {
+    if (true) {
       inDoubleQuote = !inDoubleQuote
       hasQuotedContent = true
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] BooleanLiteral
src/parseCommand.ts:49:23
 
     // Handle double quotes
     if (char === '"' && !inSingleQuote) {
-      inDoubleQuote = !inDoubleQuote
+      inDoubleQuote = inDoubleQuote
       hasQuotedContent = true
       continue
killedBy: parseCommand quoted arguments should handle double-quoted argument with spaces
statusReason: expected [ 'hello', 'world' ] to deeply equal [ 'hello world' ]

[Killed] BooleanLiteral
src/parseCommand.ts:50:26
     // Handle double quotes
     if (char === '"' && !inSingleQuote) {
       inDoubleQuote = !inDoubleQuote
-      hasQuotedContent = true
+      hasQuotedContent = false
       continue
     }
killedBy: parseCommand quoted arguments should handle empty quoted strings
statusReason: expected [] to deeply equal [ '', '' ]

[Killed] ConditionalExpression
src/parseCommand.ts:55:9
     }
 
     // Handle single quotes
-    if (char === "'" && !inDoubleQuote) {
+    if (true) {
       inSingleQuote = !inSingleQuote
       hasQuotedContent = true
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:55:9
     }
 
     // Handle single quotes
-    if (char === "'" && !inDoubleQuote) {
+    if (true && !inDoubleQuote) {
       inSingleQuote = !inSingleQuote
       hasQuotedContent = true
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] BooleanLiteral
src/parseCommand.ts:56:23
 
     // Handle single quotes
     if (char === "'" && !inDoubleQuote) {
-      inSingleQuote = !inSingleQuote
+      inSingleQuote = inSingleQuote
       hasQuotedContent = true
       continue
killedBy: parseCommand quoted arguments should handle single-quoted argument with spaces
statusReason: expected [ 'hello', 'world' ] to deeply equal [ 'hello world' ]

[Survived] BooleanLiteral
src/parseCommand.ts:57:26
     // Handle single quotes
     if (char === "'" && !inDoubleQuote) {
       inSingleQuote = !inSingleQuote
-      hasQuotedContent = true
+      hasQuotedContent = false
       continue
     }

[Killed] ConditionalExpression
src/parseCommand.ts:62:9
     }
 
     // Handle whitespace (token separator when not in quotes)
-    if ((char === ' ' || char === '\t') && !inDoubleQuote && !inSingleQuote) {
+    if (false) {
       if (current !== '' || hasQuotedContent) {
         tokens.push(current)
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected 'cd /home' to be 'cd' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:62:10
     }
 
     // Handle whitespace (token separator when not in quotes)
-    if ((char === ' ' || char === '\t') && !inDoubleQuote && !inSingleQuote) {
+    if ((true) && !inDoubleQuote && !inSingleQuote) {
       if (current !== '' || hasQuotedContent) {
         tokens.push(current)
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:63:11
 
     // Handle whitespace (token separator when not in quotes)
     if ((char === ' ' || char === '\t') && !inDoubleQuote && !inSingleQuote) {
-      if (current !== '' || hasQuotedContent) {
+      if (false) {
         tokens.push(current)
         current = ''
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected 'cd/home' to be 'cd' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:63:11
 
     // Handle whitespace (token separator when not in quotes)
     if ((char === ' ' || char === '\t') && !inDoubleQuote && !inSingleQuote) {
-      if (current !== '' || hasQuotedContent) {
+      if (false || hasQuotedContent) {
         tokens.push(current)
         current = ''
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected 'cd/home' to be 'cd' // Object.is equality

[Killed] StringLiteral
src/parseCommand.ts:65:19
     if ((char === ' ' || char === '\t') && !inDoubleQuote && !inSingleQuote) {
       if (current !== '' || hasQuotedContent) {
         tokens.push(current)
-        current = ''
+        current = "Stryker was here!"
         hasQuotedContent = false
       }
killedBy: parseCommand basic parsing should parse a command with one argument
statusReason: expected [ 'Stryker was here!/home' ] to deeply equal [ '/home' ]

[Killed] BooleanLiteral
src/parseCommand.ts:66:28
       if (current !== '' || hasQuotedContent) {
         tokens.push(current)
         current = ''
-        hasQuotedContent = false
+        hasQuotedContent = true
       }
       continue
killedBy: parseCommand basic parsing should handle extra whitespace between arguments
statusReason: expected [ '', '', '-la', '', '', '', '/home' ] to deeply equal [ '-la', '/home' ]

[Killed] BlockStatement
src/parseCommand.ts:76:16
   }
 
   // Handle trailing backslash (preserve it)
-  if (escaped) {
-    current += '\\'
-  }
+  if (escaped) {}
 
   // Don't forget the last token
killedBy: parseCommand escape sequences should preserve trailing backslash
statusReason: expected [ 'hello' ] to deeply equal [ 'hello\' ]

[Killed] ConditionalExpression
src/parseCommand.ts:76:7
   }
 
   // Handle trailing backslash (preserve it)
-  if (escaped) {
+  if (true) {
     current += '\\'
   }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected 'ls\' to be 'ls' // Object.is equality

[Killed] EqualityOperator
src/parseCommand.ts:81:7
   }
 
   // Don't forget the last token
-  if (current !== '' || hasQuotedContent) {
+  if (current === '' || hasQuotedContent) {
     tokens.push(current)
   }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] ConditionalExpression
src/parseCommand.ts:81:7
   }
 
   // Don't forget the last token
-  if (current !== '' || hasQuotedContent) {
+  if (false) {
     tokens.push(current)
   }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[Killed] LogicalOperator
src/parseCommand.ts:85:19
     tokens.push(current)
   }
 
-  const command = tokens[0] || ''
+  const command = tokens[0] && ''
   const args = tokens.slice(1)
 
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected '' to be 'ls' // Object.is equality

[NoCoverage] StringLiteral
src/parseCommand.ts:85:32
     tokens.push(current)
   }
 
-  const command = tokens[0] || ''
+  const command = tokens[0] || "Stryker was here!"
   const args = tokens.slice(1)
 

[Killed] MethodExpression
src/parseCommand.ts:86:16
   }
 
   const command = tokens[0] || ''
-  const args = tokens.slice(1)
+  const args = tokens
 
   return { command, args, raw }
killedBy: parseCommand basic parsing should parse a simple command with no arguments
statusReason: expected [ 'ls' ] to deeply equal []
