[Killed] BooleanLiteral
src/pathUtils.ts:15:7
  * - Removing trailing slash (except for root)
  */
 export function normalizePath(path: string): string {
-  if (!path) {
+  if (path) {
     return '/'
   }
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: expected '/' to be '/home' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:15:7
  * - Removing trailing slash (except for root)
  */
 export function normalizePath(path: string): string {
-  if (!path) {
+  if (true) {
     return '/'
   }
killedBy: ls command execute with no arguments (current directory) should list current directory when no args provided
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user",

[Killed] StringLiteral
src/pathUtils.ts:16:12
  */
 export function normalizePath(path: string): string {
   if (!path) {
-    return '/'
+    return ""
   }
 
killedBy: pathUtils normalizePath should return "/" for empty string
statusReason: expected '' to be '/' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:23:56
   let normalized = path.replace(/\\/g, '/')
 
   // Split into segments
-  const segments = normalized.split('/').filter((s) => s !== '')
+  const segments = normalized.split('/').filter((s) => false)
 
   // Resolve . and .. segments
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: expected '/' to be '/home' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:23:56
   let normalized = path.replace(/\\/g, '/')
 
   // Split into segments
-  const segments = normalized.split('/').filter((s) => s !== '')
+  const segments = normalized.split('/').filter((s) => true)
 
   // Resolve . and .. segments
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should default to root directory
statusReason: expected '//' to be '/' // Object.is equality

[Killed] ArrayDeclaration
src/pathUtils.ts:26:30
   const segments = normalized.split('/').filter((s) => s !== '')
 
   // Resolve . and .. segments
-  const resolved: string[] = []
+  const resolved: string[] = ["Stryker was here"]
   for (const segment of segments) {
     if (segment === '.') {
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should default to root directory
statusReason: expected '/Stryker was here' to be '/' // Object.is equality

[Killed] BlockStatement
src/pathUtils.ts:27:35
 
   // Resolve . and .. segments
   const resolved: string[] = []
-  for (const segment of segments) {
-    if (segment === '.') {
-      continue
-    }
-    if (segment === '..') {
-      resolved.pop()
-    } else {
-      resolved.push(segment)
-    }
-  }
+  for (const segment of segments) {}
 
   // Build the result path
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: expected '/' to be '/home' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:28:9
   // Resolve . and .. segments
   const resolved: string[] = []
   for (const segment of segments) {
-    if (segment === '.') {
+    if (false) {
       continue
     }
killedBy: mv command execute when source and destination are the same should return error when paths resolve to same location
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:28:9
   // Resolve . and .. segments
   const resolved: string[] = []
   for (const segment of segments) {
-    if (segment === '.') {
+    if (true) {
       continue
     }
killedBy: createFileSystemAdapter getCurrentDirectory / setCurrentDirectory should set and get current directory
statusReason: expected '/' to be '/home' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:31:9
     if (segment === '.') {
       continue
     }
-    if (segment === '..') {
+    if (false) {
       resolved.pop()
     } else {
killedBy: cd command execute with valid path should resolve parent directory (..) correctly
statusReason: expected "vi.fn()" to be called with arguments: [ '/home' ]

Received: 

  1st vi.fn() call:

  [
-   "/home",

[Killed] ConditionalExpression
src/pathUtils.ts:31:9
     if (segment === '.') {
       continue
     }
-    if (segment === '..') {
+    if (true) {
       resolved.pop()
     } else {
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/pathUtils.ts:33:12
     }
     if (segment === '..') {
       resolved.pop()
-    } else {
-      resolved.push(segment)
-    }
+    } else {}
   }
 
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/pathUtils.ts:39:38
   }
 
   // Build the result path
-  const result = '/' + resolved.join('/')
+  const result = '/' + resolved.join("")
 
   return result
killedBy: mv command execute moving file should move file with absolute paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/source.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/source.txt",

[Killed] StringLiteral
src/pathUtils.ts:49:16
  * If any segment is absolute (starts with /), it resets the base.
  */
 export function joinPath(...segments: string[]): string {
-  let result = ''
+  let result = "Stryker was here!"
 
   for (const segment of segments) {
killedBy: pathUtils joinPath should handle empty base
statusReason: expected '/Stryker was here!/foo' to be '/foo' // Object.is equality

[Killed] BlockStatement
src/pathUtils.ts:51:35
 export function joinPath(...segments: string[]): string {
   let result = ''
 
-  for (const segment of segments) {
-    if (!segment) {
-      continue
-    }
-
-    // Convert backslashes
-    const normalized = segment.replace(/\\/g, '/')
-
-    if (normalized.startsWith('/')) {
-      // Absolute path resets the result
-      result = normalized
-    } else if (result) {
-      result = result + '/' + normalized
-    } else {
-      result = normalized
-    }
-  }
+  for (const segment of segments) {}
 
   return normalizePath(result)
killedBy: mv command execute moving file should move file with relative paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/pathUtils.ts:52:9
   let result = ''
 
   for (const segment of segments) {
-    if (!segment) {
+    if (segment) {
       continue
     }
killedBy: mv command execute moving file should move file with relative paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:52:9
   let result = ''
 
   for (const segment of segments) {
-    if (!segment) {
+    if (true) {
       continue
     }
killedBy: pathUtils joinPath should join two path segments
statusReason: expected '/' to be '/foo/bar' // Object.is equality

[Killed] StringLiteral
src/pathUtils.ts:57:47
     }
 
     // Convert backslashes
-    const normalized = segment.replace(/\\/g, '/')
+    const normalized = segment.replace(/\\/g, "")
 
     if (normalized.startsWith('/')) {
killedBy: cd command edge cases should handle backslashes in path
statusReason: expected "vi.fn()" to be called with arguments: [ '/var/log' ]

Received: 

  1st vi.fn() call:

  [
-   "/var/log",

[Killed] BlockStatement
src/pathUtils.ts:59:37
     // Convert backslashes
     const normalized = segment.replace(/\\/g, '/')
 
-    if (normalized.startsWith('/')) {
-      // Absolute path resets the result
-      result = normalized
-    } else if (result) {
+    if (normalized.startsWith('/')) {} else if (result) {
       result = result + '/' + normalized
     } else {
killedBy: createFileSystemAdapter listDirectory should convert string array to FileEntry array
statusReason: expected [ { name: 'file1.txt', …(2) }, …(1) ] to deep equally contain { name: 'file1.txt', …(2) }

[Killed] ConditionalExpression
src/pathUtils.ts:59:9
     // Convert backslashes
     const normalized = segment.replace(/\\/g, '/')
 
-    if (normalized.startsWith('/')) {
+    if (true) {
       // Absolute path resets the result
       result = normalized
killedBy: cd command execute with valid path should change to relative path
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/projects' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/projects",

[Killed] BlockStatement
src/pathUtils.ts:62:24
     if (normalized.startsWith('/')) {
       // Absolute path resets the result
       result = normalized
-    } else if (result) {
-      result = result + '/' + normalized
-    } else {
+    } else if (result) {} else {
       result = normalized
     }
killedBy: cp command execute copying file should copy file with relative paths
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:62:16
     if (normalized.startsWith('/')) {
       // Absolute path resets the result
       result = normalized
-    } else if (result) {
+    } else if (false) {
       result = result + '/' + normalized
     } else {
killedBy: cp command execute copying file should copy file with relative paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/source.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/source.txt",

[Killed] BlockStatement
src/pathUtils.ts:64:12
       result = normalized
     } else if (result) {
       result = result + '/' + normalized
-    } else {
-      result = normalized
-    }
+    } else {}
   }
 
killedBy: pathUtils joinPath should handle empty base
statusReason: expected '/' to be '/foo' // Object.is equality

[Killed] ConditionalExpression
src/pathUtils.ts:78:7
  * If relative, it's joined with the base.
  */
 export function resolvePath(base: string, path: string): string {
-  if (isAbsolutePath(path)) {
+  if (true) {
     return normalizePath(path)
   }
killedBy: cp command execute copying file should copy file with relative paths
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/source.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/source.txt",

[Survived] BlockStatement
src/pathUtils.ts:78:29
  * If relative, it's joined with the base.
  */
 export function resolvePath(base: string, path: string): string {
-  if (isAbsolutePath(path)) {
-    return normalizePath(path)
-  }
+  if (isAbsolutePath(path)) {}
   return joinPath(base, path)
 }

[Killed] MethodExpression
src/pathUtils.ts:88:10
  * Check if a path is absolute (starts with /).
  */
 export function isAbsolutePath(path: string): boolean {
-  return path.startsWith('/')
+  return path.endsWith('/')
 }
 
killedBy: pathUtils isAbsolutePath should return true for paths starting with /
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/pathUtils.ts:98:7
 export function getParentPath(path: string): string {
   const normalized = normalizePath(path)
 
-  if (normalized === '/') {
+  if (normalized !== '/') {
     return '/'
   }
killedBy: createFileSystemAdapter createDirectory should throw error if parent does not exist
statusReason: expected [Function] to throw error including 'Parent directory not found: /missing' but got 'Parent directory not found: /'

[Killed] ConditionalExpression
src/pathUtils.ts:98:7
 export function getParentPath(path: string): string {
   const normalized = normalizePath(path)
 
-  if (normalized === '/') {
+  if (true) {
     return '/'
   }
killedBy: createFileSystemAdapter createDirectory should throw error if parent does not exist
statusReason: expected [Function] to throw error including 'Parent directory not found: /missing' but got 'Parent directory not found: /'

[Killed] BlockStatement
src/pathUtils.ts:103:23
   }
 
   const lastSlash = normalized.lastIndexOf('/')
-  if (lastSlash <= 0) {
-    return '/'
-  }
+  if (lastSlash <= 0) {}
 
   return normalized.substring(0, lastSlash)
killedBy: pathUtils getParentPath should return root for root children
statusReason: expected '' to be '/' // Object.is equality

[Killed] EqualityOperator
src/pathUtils.ts:103:7
   }
 
   const lastSlash = normalized.lastIndexOf('/')
-  if (lastSlash <= 0) {
+  if (lastSlash < 0) {
     return '/'
   }
killedBy: createFileSystemAdapter createDirectory should create a directory
statusReason: Parent directory not found:

[Killed] MethodExpression
src/pathUtils.ts:107:10
     return '/'
   }
 
-  return normalized.substring(0, lastSlash)
+  return normalized
 }
 
killedBy: pathUtils getParentPath should return parent directory
statusReason: expected '/foo/bar' to be '/foo' // Object.is equality

[Killed] StringLiteral
src/pathUtils.ts:118:12
   const normalized = normalizePath(path)
 
   if (normalized === '/') {
-    return ''
+    return "Stryker was here!"
   }
 
killedBy: pathUtils getBasename should handle root path
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] MethodExpression
src/pathUtils.ts:122:10
   }
 
   const lastSlash = normalized.lastIndexOf('/')
-  return normalized.substring(lastSlash + 1)
+  return normalized
 }
 
killedBy: ls command execute with path argument should show file info when path is a file
statusReason: expected '/home/user/file.txt' to be 'file.txt' // Object.is equality

[Killed] ArithmeticOperator
src/pathUtils.ts:122:31
   }
 
   const lastSlash = normalized.lastIndexOf('/')
-  return normalized.substring(lastSlash + 1)
+  return normalized.substring(lastSlash - 1)
 }
 
killedBy: ls command execute with path argument should show file info when path is a file
statusReason: expected 'r/file.txt' to be 'file.txt' // Object.is equality
