[Killed] ConditionalExpression
src/commands/mkdir.ts:14:47
  */
 function getPathSegments(path: string): string[] {
   const segments: string[] = []
-  const parts = path.split('/').filter((p) => p !== '')
+  const parts = path.split('/').filter((p) => true)
 
   let current = ''
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/a",

[Killed] ArrowFunction
src/commands/mkdir.ts:14:40
  */
 function getPathSegments(path: string): string[] {
   const segments: string[] = []
-  const parts = path.split('/').filter((p) => p !== '')
+  const parts = path.split('/').filter(() => undefined)
 
   let current = ''
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:17:29
   const parts = path.split('/').filter((p) => p !== '')
 
   let current = ''
-  for (const part of parts) {
-    current = current + '/' + part
-    segments.push(current)
-  }
+  for (const part of parts) {}
 
   return segments
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:28:73
 /**
  * Create directory and all parent directories as needed.
  */
-function createWithParents(resolvedPath: string, fs: IFileSystem): void {
-  const segments = getPathSegments(resolvedPath)
-
-  for (const segment of segments) {
-    // Skip if already exists as a directory
-    if (fs.exists(segment) && fs.isDirectory(segment)) {
-      continue
-    }
-    fs.createDirectory(segment)
-  }
-}
+function createWithParents(resolvedPath: string, fs: IFileSystem): void {}
 
 /**
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:31:35
 function createWithParents(resolvedPath: string, fs: IFileSystem): void {
   const segments = getPathSegments(resolvedPath)
 
-  for (const segment of segments) {
-    // Skip if already exists as a directory
-    if (fs.exists(segment) && fs.isDirectory(segment)) {
-      continue
-    }
-    fs.createDirectory(segment)
-  }
+  for (const segment of segments) {}
 }
 
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Number of calls: 0

[Killed] ConditionalExpression
src/commands/mkdir.ts:33:9
 
   for (const segment of segments) {
     // Skip if already exists as a directory
-    if (fs.exists(segment) && fs.isDirectory(segment)) {
+    if (false) {
       continue
     }
killedBy: mkdir command -p flag (create parent directories) should skip existing directories with -p flag (no error)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 3 times

Received: 

  1st vi.fn() call:

    Array [
      "/home",

[Killed] BlockStatement
src/commands/mkdir.ts:33:56
 
   for (const segment of segments) {
     // Skip if already exists as a directory
-    if (fs.exists(segment) && fs.isDirectory(segment)) {
-      continue
-    }
+    if (fs.exists(segment) && fs.isDirectory(segment)) {}
     fs.createDirectory(segment)
   }
killedBy: mkdir command -p flag (create parent directories) should skip existing directories with -p flag (no error)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 3 times

Received: 

  1st vi.fn() call:

    Array [
      "/home",

[Killed] StringLiteral
src/commands/mkdir.ts:46:9
  * Supports -p flag to create parent directories.
  */
 export const mkdir: Command = {
-  name: 'mkdir',
+  name: "",
   description: 'Create directories',
   usage: 'mkdir [-p] <directory>...',
killedBy: mkdir command metadata should have correct name
statusReason: expected '' to be 'mkdir' // Object.is equality

[Killed] StringLiteral
src/commands/mkdir.ts:47:16
  */
 export const mkdir: Command = {
   name: 'mkdir',
-  description: 'Create directories',
+  description: "",
   usage: 'mkdir [-p] <directory>...',
 
killedBy: mkdir command metadata should have a description
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/commands/mkdir.ts:52:41
 
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Parse -p flag
-    const createParents = args.includes('-p')
+    const createParents = args.includes("")
     const paths = args.filter((arg) => arg !== '-p')
 
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/a",

[Killed] ConditionalExpression
src/commands/mkdir.ts:53:40
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Parse -p flag
     const createParents = args.includes('-p')
-    const paths = args.filter((arg) => arg !== '-p')
+    const paths = args.filter((arg) => false)
 
     // Check for required argument
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected 1 to be +0 // Object.is equality

[Killed] MethodExpression
src/commands/mkdir.ts:53:19
   execute(args: string[], fs: IFileSystem): CommandResult {
     // Parse -p flag
     const createParents = args.includes('-p')
-    const paths = args.filter((arg) => arg !== '-p')
+    const paths = args
 
     // Check for required argument
killedBy: mkdir command -p flag (create parent directories) should skip existing directories with -p flag (no error)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "/home/user/-p",

[Killed] EqualityOperator
src/commands/mkdir.ts:56:9
     const paths = args.filter((arg) => arg !== '-p')
 
     // Check for required argument
-    if (paths.length === 0) {
+    if (paths.length !== 0) {
       return {
         exitCode: 1,
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/commands/mkdir.ts:56:29
     const paths = args.filter((arg) => arg !== '-p')
 
     // Check for required argument
-    if (paths.length === 0) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: 'mkdir: missing operand',
-      }
-    }
+    if (paths.length === 0) {}
 
     const currentDir = fs.getCurrentDirectory()
killedBy: mkdir command execute with no arguments should return error when no path provided
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/commands/mkdir.ts:65:30
     }
 
     const currentDir = fs.getCurrentDirectory()
-    const errors: string[] = []
+    const errors: string[] = ["Stryker was here"]
 
     // Create all directories, collecting errors
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/commands/mkdir.ts:68:37
     const errors: string[] = []
 
     // Create all directories, collecting errors
-    for (const targetPath of paths) {
-      const resolvedPath = resolvePath(currentDir, targetPath)
-
-      try {
-        if (createParents) {
-          createWithParents(resolvedPath, fs)
-        } else {
-          fs.createDirectory(resolvedPath)
-        }
-      } catch (error) {
-        const message = error instanceof Error ? error.message : String(error)
-        errors.push(`mkdir: cannot create directory '${resolvedPath}': ${message}`)
-      }
-    }
+    for (const targetPath of paths) {}
 
     if (errors.length > 0) {
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/newdir' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:71:11
     for (const targetPath of paths) {
       const resolvedPath = resolvePath(currentDir, targetPath)
 
-      try {
-        if (createParents) {
-          createWithParents(resolvedPath, fs)
-        } else {
-          fs.createDirectory(resolvedPath)
-        }
-      } catch (error) {
+      try {} catch (error) {
         const message = error instanceof Error ? error.message : String(error)
         errors.push(`mkdir: cannot create directory '${resolvedPath}': ${message}`)
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/newdir' ]

Number of calls: 0

[Killed] ConditionalExpression
src/commands/mkdir.ts:72:13
       const resolvedPath = resolvePath(currentDir, targetPath)
 
       try {
-        if (createParents) {
+        if (false) {
           createWithParents(resolvedPath, fs)
         } else {
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Received: 

  1st vi.fn() call:

  [
-   "/home/user/a",

[Killed] BlockStatement
src/commands/mkdir.ts:72:28
       const resolvedPath = resolvePath(currentDir, targetPath)
 
       try {
-        if (createParents) {
-          createWithParents(resolvedPath, fs)
-        } else {
+        if (createParents) {} else {
           fs.createDirectory(resolvedPath)
         }
killedBy: mkdir command -p flag (create parent directories) should create nested directories with -p flag
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/a' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:74:16
       try {
         if (createParents) {
           createWithParents(resolvedPath, fs)
-        } else {
-          fs.createDirectory(resolvedPath)
-        }
+        } else {}
       } catch (error) {
         const message = error instanceof Error ? error.message : String(error)
killedBy: mkdir command execute with valid path should create directory with absolute path
statusReason: expected "vi.fn()" to be called with arguments: [ '/home/user/newdir' ]

Number of calls: 0

[Killed] BlockStatement
src/commands/mkdir.ts:77:23
         } else {
           fs.createDirectory(resolvedPath)
         }
-      } catch (error) {
-        const message = error instanceof Error ? error.message : String(error)
-        errors.push(`mkdir: cannot create directory '${resolvedPath}': ${message}`)
-      }
+      } catch (error) {}
     }
 
killedBy: mkdir command execute when directory already exists should return error when path already exists
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/commands/mkdir.ts:83:28
       }
     }
 
-    if (errors.length > 0) {
-      return {
-        exitCode: 1,
-        stdout: '',
-        stderr: errors.join('\n'),
-      }
-    }
+    if (errors.length > 0) {}
 
     return {
killedBy: mkdir command execute when directory already exists should return error when path already exists
statusReason: expected +0 to be 1 // Object.is equality

[Survived] StringLiteral
src/commands/mkdir.ts:87:29
       return {
         exitCode: 1,
         stdout: '',
-        stderr: errors.join('\n'),
+        stderr: errors.join(""),
       }
     }
